Rename columns using the rename method:

In [2]:
import pandas as pd
# Create URL
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'
# Load data
dataframe = pd.read_csv(url)

In [5]:
dataframe.head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

Notice that the rename method can accept a dictionary as a parameter

In [4]:
dataframe.rename(columns={'Sex' : 'Gender', 'PClass' : 'Passenger Class'}).head(2)

,Name,Passenger Class,Age,Gender,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1

Using rename with a dictionary as an argument to the columns parameter is my
preferred way to rename columns because it works with any number of columns.